Revit 2027 API
EnergyDataSettings.UseOutsideAirPerArea Property
Note: This API is now obsolete.
 True is user is specifying outside air per area, false otherwise.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public bool UseOutsideAirPerArea { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property UseOutsideAirPerArea As Boolean
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property bool UseOutsideAirPerArea {
	bool get ();
	void set (bool value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member UseOutsideAirPerArea : bool with get, set
Property Value
Boolean
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace